[
    {
        "id": 1,
        "titre": "Réflexion et mise en commun",
        "date": "2025-10-09",
        "contenu": "Le projet commence par une phase de réflexion individuelle. Chacun essaie d’imaginer la meilleure façon de construire une grue. L'objectif est de soulever une charge avec les moyens du bord : du carton, de la ficelle, des pics à brochette et cinq poulies. Une fois les idées posées, elles sont mises en commun pour voir ce qui fonctionne le mieux. <img src=\"img/mise_commun.jpeg\" alt=\"Photo de la mise en commun\" class=\"imgArticle\"> Avec les ressources qu’on avait, on a d’abord pensé à un design avec une roue de hamster, mais c’était trop compliqué à faire. On a donc préféré s’appuyer sur les modèles proposés par d’autres membres du groupe, plus simples et plus réalisables.",
        "background": "#FFFDE5"
    },
    {
        "id": 2,
        "titre": "Analyse du design",
        "date": "2025-10-09",
        "contenu": "La deuxième phase consiste à confronter les idées et à en corriger les défauts. <img src=\"img/hamster.jpeg\" alt=\"Photo de hamster\" class=\"imgArticle\"> Plusieurs contraintes apparaissent rapidement : il n’est pas possible de faire avancer la grue sur un axe linéaire avec les plans actuels, il devra être corrigé dans les itérations suivantes. <img src=\"img/grue_top.jpeg\" alt=\"Photo de la grue vue de haut\" class=\"imgArticle\"> Autre point soulevé : placer le pivot de rotation en haut de la structure est mécaniquement instable, il devra donc être positionné plus bas pour garantir un meilleur équilibre. Ces discussions permettent d’affiner le design et d’obtenir une version plus réaliste du modèle.",
        "background": "#F3E5FF" 
    },
    {
        "id": 3,
        "titre": "Plans et calculs de forces",
        "date": "2025-10-09",
        "contenu": "Une fois le concept validé, les plans sont réalisés sur le logiciel CATIA V5 et canva, <img src=\"img/plan_main.jpeg\" alt=\"Photo du plan principal\" class=\"imgArticle\"> <img src=\"img/plan-1.jpeg\" alt=\"Photo du plan 1\" class=\"imgArticle articleMini\"> <img src=\"img/plan-2.jpeg\" alt=\"Photo du plan 2\" class=\"imgArticle articleMini\"> <img src=\"img/plan-3.jpeg\" alt=\"Photo du plan 3\" class=\"imgArticle articleMini\">  afin de visualiser la structure en trois dimensions et de préparer les patrons à découper. l'analyse des moments et des forces pour vérifier la résistance des matériaux et la stabilité de la structure contre tout risque de rupture ou de basculement, ainsi que le calcul de la démultiplication par poulies pour assurer que le système de levage soit manœuvrable par une seule personne. <img src=\"img/calculs.jpeg\" alt=\"Photo des calculs\" class=\"imgArticle\"> Ces calculs nous permettent de mieux visualiser la faisabilité du projet en situation réelle et sur la maquette.",
        "background": "#E5FFFF"
    },
    {
        "id": 4,
        "titre": "Traçage du patron sur le carton",
        "date": "2025-10-09",
        "contenu": "À partir des plans réalisés, les différentes pièces de la grue sont tracées à la main sur les cartons. Une règle et une équerre sont utilisées pour garantir des dimensions précises et des angles justes. Cette étape demande minutie et patience, car la précision du traçage conditionne directement la stabilité et la symétrie de la grue finale. <img src=\"img/trace.jpeg\" alt=\"Photo du traçage\" class=\"imgArticle\">",
        "background": "#FFE5F7"
    },
    {
        "id": 5,
        "titre": "Découpe des pièces",
        "date": "2025-10-09",
        "contenu": "Une fois les patrons tracés, le découpage est effectué soigneusement à l’aide d’un cutter. Chaque élément doit être découpé avec précision pour pouvoir s’assembler correctement par la suite. Le carton, à la fois léger et fragile, nécessite de la rigueur pour éviter les déchirures et les imprécisions. <img src=\"img/decoupe.jpeg\" alt=\"Photo de la découpe\" class=\"imgArticle\">",
        "background": "#FFF2E5"
    },
    {
        "id": 6,
        "titre": "Assemblage et construction finale",
        "date": "2025-10-09",
        "contenu": "La dernière étape consiste à assembler la grue. Les différentes pièces sont reliées entre elles sans colle ni scotch, uniquement grâce aux pics à brochette qui servent de tiges d’articulation. Les poulies et la ficelle sont ensuite installées pour former le système de levage et reproduire la démultiplication de force observée dans les grues réelles. Le modèle obtenu permet d’illustrer le fonctionnement mécanique d’une grue à échelle réelle, tout en respectant les contraintes imposées par les matériaux disponibles. <img src=\"img/build.jpeg\" alt=\"Photo de l'assemblage\" class=\"imgArticle\">",
        "background": "#E8E5FF"
    }
]